# Inputs and Outputs

Pandas can read variety of file types using its pd.read_ methods. To write to different file types, Pandas use output methods called directly off the dataframe with df.to_.

In [4]:
import numpy as np
import pandas as pd

# Reading in a CSV

Comma Separated Values files are text files that use commas as field delimeters.<br>
You may need to install <tt>xlrd</tt> and <tt>openpyxl</tt>.<br>
In your terminal/command prompt run:

    conda install xlrd
    conda install openpyxl
Then restart Jupyter Notebook.
(or use pip install if you aren't using the Anaconda Distribution)

## CSV Input

To read csv files in Pandas, we simply use pd.read_csv(filename.csv). If the python and the csv file are in the different directories, we need to specify the full path to the file.

In [5]:
df = pd.read_csv('example.csv')

In [6]:
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

Pandas takes the first row a s a header as its datatype is different from the rest of the data. To ignore the header, the command below can be used:

In [7]:
df = pd.read_csv('example.csv', header=None)

In [8]:
df

    0   1   2   3
0   a   b   c   d
1   0   1   2   3
2   4   5   6   7
3   8   9  10  11
4  12  13  14  15

Pandas adds the index column to the csv data automatically when displayed. To make the first column the index column, index_col=0 parameter should be used.

In [9]:
df = pd.read_csv('example.csv', index_col=0)

In [10]:
df

     b   c   d
a
0    1   2   3
4    5   6   7
8    9  10  11
12  13  14  15

## CSV Output

Pandas adds the index column to the csv file as a default and call it "Unnamed:0" if your index did not have a name. To prevent this, index should be set to False.

In [11]:
df = pd.read_csv('example.csv')

In [12]:
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [13]:
df.to_csv('new_file.csv', index=False)

# HTML

Pandas can read table tabs off of HTML. This only works if your firewall isn't blocking pandas from accessing the internet!

Unless you're running the virtual environment, you may need to install <tt>lxml</tt>, <tt>htmllib5</tt>, and <tt>BeautifulSoup4</tt>.<br>
In your terminal/command prompt run:

    conda install lxml
    
    or
    
    pip install lxml
    
Then restart Jupyter Notebook (you may need to restart your computer).
(or use pip install if you aren't using the Anaconda Distribution)

## read_html

### HTML Input

Pandas read_html function will read tables off of a webpage and return a list of DataFrame objects.

In [14]:
tables = pd.read_html('https://en.wikipedia.org/wiki/World_population')

In [15]:
len(tables)

26

## Tables that need formatting

Some tables will be misaligned, so you need to do extra work on those to fix rows and columns:

In [16]:
tables[0]

        World population (millions, UN estimates)[15]  \
                                                    #
0                                                   1
1                                                   2
2                                                   3
3                                                   4
4                                                   5
5                                                   6
6                                                   7
7                                                   8
8                                                   9
9                                                  10
10                                                NaN
11  Notes: .mw-parser-output .reflist{font-size:90...

                                                       \
                      Top ten most populous countries
0                                            China[B]
1                                               India
2                                       United States
3                                           Indonesia
4                                            Pakistan
5                                              Brazil
6                                             Nigeria
7                                          Bangladesh
8                                              Russia
9                                              Mexico
10                                        World total
11  Notes: .mw-parser-output .reflist{font-size:90...

                                                       \
                                                 2000
0                                                1270
1                                                1053
2                                                 283
3                                                 212
4                                                 136
5                                                 176
6                                                 123
7                                                 131
8                                                 146
9                                                 103
10                                               6127
11  Notes: .mw-parser-output .reflist{font-size:90...

                                                       \
                                                 2015
0                                                1376
1                                                1311
2                                                 322
3                                                 258
4                                                 208
5                                                 206
6                                                 182
7                                                 161
8                                                 146
9                                                 127
10                                               7349
11  Notes: .mw-parser-output .reflist{font-size:90...


                                              2030[A]
0                                                1416
1                                                1528
2                                                 356
3                                                 295
4                                                 245
5                                                 228
6                                                 263
7                                                 186
8                                                 149
9                                                 148
10                                               8501
11  Notes: .mw-parser-output .reflist{font-size:90...

In [17]:
world_pop = tables[0]
world_pop.columns

MultiIndex([('World population (millions, UN estimates)[15]', ...),
            ('World population (millions, UN estimates)[15]', ...),
            ('World population (millions, UN estimates)[15]', ...),
            ('World population (millions, UN estimates)[15]', ...),
            ('World population (millions, UN estimates)[15]', ...)],
           )

In [18]:
world_pop = world_pop['World population (millions, UN estimates)[15]'].drop('#', axis=1)

In [19]:
world_pop.columns

Index(['Top ten most populous countries', '2000', '2015', '2030[A]'], dtype='object')

In [20]:
world_pop.columns = ['Countries', '2000', '2015', '2030 Est.']
world_pop = world_pop.drop(11,axis=0)
world_pop

        Countries  2000  2015 2030 Est.
0        China[B]  1270  1376      1416
1           India  1053  1311      1528
2   United States   283   322       356
3       Indonesia   212   258       295
4        Pakistan   136   208       245
5          Brazil   176   206       228
6         Nigeria   123   182       263
7      Bangladesh   131   161       186
8          Russia   146   146       149
9          Mexico   103   127       148
10    World total  6127  7349      8501

## Write to html Output

If you are working on a website and want to quickly output the .html file, you can use to_html

In [21]:
df.to_html('simple.html',index=False)

# Excel Files

Pandas can read in basic excel files (it will get errors if there are macros or extensive formulas relying on outside excel files), in general, pandas can only grab the raw information from an .excel file.

#### NOTE: Requires the openpyxl and xlrd library! You can simply install with:

    pip install openpyxl
    pip install xlrd
    
## Excel file input with read_excel()

In [22]:
df = pd.read_excel('new_excel.xlsx', sheet_name='Sheet1')

df

   a  b   c   d
0  1  5   9  13
1  2  6  10  14
2  3  7  11  15
3  4  8  12  16

### What if you don't know the sheet name? Or want to run a for loop for certain sheet names? Or want every sheet?

In [23]:
# Returns a list of sheet_names
pd.ExcelFile('new_excel.xlsx').sheet_names

['Sheet1', 'Sheet2']

#### Grab all sheets

In Pandas, Excel files are dictionaries with sheet names being the keys and data being the values.

In [24]:
excel_sheets = pd.read_excel('new_excel.xlsx',sheet_name=None)

type(excel_sheets)

dict

In [25]:
excel_sheets.keys()

dict_keys(['Sheet1', 'Sheet2'])

In [26]:
excel_sheets['Sheet2']

   aa  ab  ac
0  11  12  13
1  21  22  23
2  31  32  33

## Write to Excel File

In [27]:
df.to_excel('example.xlsx', sheet_name='First_Sheet', index=False)